sudo-kachponz/robotku/firmware/robotku-esp32/src/main.cpp
// The ONE place a servo angle is written. Both the JSON path (driveChannel) and
// the bench text path (a bare 0-180) go through here, so the OLED mirror and the
// unwired-channel guard can't drift apart.
void servoWriteAngle(int ch, int deg) {
  if (ch < 0 || ch > 1) return;
  if (ch == 1 && !HAS_SERVO_R) return;   // right servo not soldered — nothing to drive
  deg = constrain(deg, 0, 180);
  Servo* s = (ch == 0) ? &servoL : &servoR;
  s->write(deg);
  servoAngle[ch] = deg;
  oledDirty = true;                      // pushed by loop(), throttled
}

// STOP / CW / CCW for a channel, derived from the angle actually written
// relative to that channel's trimmed neutral — no extra state to keep in sync.
const char* servoDirLabel(int ch) {
  int d = servoAngle[ch] - servoNeutralDeg(ch);
  if (d > 2)  return "CW";
  if (d < -2) return "CCW";
  return "STOP";
}

// One continuous-servo channel. value in [-100,100]: + = forward for that side
// AFTER invert is applied, 0 = stop (with trim), - = reverse.
void driveChannel(int ch, int value) {
  value = constrain(value, -100, 100);
  int trim   = (ch == 0) ? SERVO_L_TRIM : SERVO_R_TRIM;
  bool invert = (ch == 0) ? false : (SERVO_R_INVERT != 0);

  int eff = invert ? -value : value;
  // Continuous SG90: 90 = stop, ±90 span. Trim nudges the neutral point.
  servoWriteAngle(ch, SERVO_STOP_DEG + trim + (eff * 90) / 100);
}

// Tank drive: left/right in [-100,100], + = forward.
void driveTank(int left, int right) {
  driveChannel(0, left);
  driveChannel(1, right);
}

// STOP_ALL / failsafe / deadline: every channel to neutral, cancel any deadline.
void stopAllActuators() {
  driveChannel(0, 0);
  driveChannel(1, 0);
  motionEndsAtMs = 0;
}

// RGB LED (FW-06). Digital 8-color (any mix of R/G/B) — PWM stutters servo 2 on this
// board, so on/off keeps both servos smooth. r/g/b are 0..255; >127 = "on".
void setLedColor(int r, int g, int b) {
#if HAS_RGB
  digitalWrite(PIN_LED_R, r > 127 ? HIGH : LOW);
  digitalWrite(PIN_LED_G, g > 127 ? HIGH : LOW);
  digitalWrite(PIN_LED_B, b > 127 ? HIGH : LOW);
#else
  (void)r; (void)g; (void)b;
#endif
}

// =============================================================== OLED
// "BLE" | "USB" | "Terputus" — what the board is actually talking to.
const char* connLabel() {
  if (bleConnected) return "BLE";
  if (usbSeen)      return "USB";
  return "Terputus";
}

// Build the frame and push it. Callers go through oledPushIfDue(), never here.
void oledRender() {
  oled.clearDisplay();
  oled.setTextColor(SSD1306_WHITE);

  // Pixel-art bitmap mode: scale the w x h grid to fill the panel and bail early.
  if (oledBitmapMode && oledBmpW > 0 && oledBmpH > 0) {
    int cw = OLED_WIDTH / oledBmpW;
    int ch = OLED_HEIGHT / oledBmpH;
    for (int r = 0; r < oledBmpH; r++) {
      for (int c = 0; c < oledBmpW; c++) {
        if (oledBmp[r * oledBmpW + c] == '1') oled.fillRect(c * cw, r * ch, cw, ch, SSD1306_WHITE);
      }
    }
    oled.display();
    return;
  }

  // Row 1: brand + which link we are on.
  oled.setTextSize(1);
  oled.setCursor(0, 0);
  oled.print(F("Robotku"));
  const char* conn = connLabel();
  oled.setCursor(128 - 6 * (int)strlen(conn), 0);   // right-aligned, 6px/char
  oled.print(conn);

  // Row 2: the headline status, big enough to read from across the table.
  oled.setTextSize(2);
  oled.setCursor(0, 12);
  oled.print(oledLine1);

  // Row 3: real servo position + direction, per channel (ControllerV1 style).
  oled.setTextSize(1);
  oled.setCursor(0, 32);
  char buf[24];
  if (HAS_SERVO_R) {
    snprintf(buf, sizeof(buf), "L%3d %-4s R%3d %s",
             servoAngle[0], servoDirLabel(0), servoAngle[1], servoDirLabel(1));
  } else {
    // Honest about the hardware: no second servo, so no second reading.
    snprintf(buf, sizeof(buf), "L%3d %-4s R  --", servoAngle[0], servoDirLabel(0));
  }
  oled.print(buf);

  // Row 4: detail line.
  oled.setCursor(0, 46);
  oled.print(oledLine2);

  oled.display();
}

// Push a pending frame if the display has had its ~30 ms to breathe. Called from
// loop() and opportunistically right after a status change so single events
// (HELLO, STOP) appear immediately instead of waiting for the next tick.
void oledPushIfDue() {
  if (!oledOk || !oledDirty) return;
  unsigned long now = millis();
  if (now - lastOledPushMs < OLED_MIN_PUSH_INTERVAL_MS) return;
  lastOledPushMs = now;
  oledDirty = false;
  oledRender();
}

void oledStatus(const String& line1, const String& line2) {
  oledLine1 = line1;
  oledLine2 = line2;
  oledBitmapMode = false; // a status update takes the panel back from bitmap mode
  oledDirty = true;
  oledPushIfDue();
}

void oledSplash() {
  if (!oledOk) return;
  oled.clearDisplay();
  // Simple friendly robot face — the "robot is alive" cue for kids.
  oled.drawRoundRect(34, 8, 60, 40, 8, SSD1306_WHITE);   // head
  oled.fillCircle(52, 26, 5, SSD1306_WHITE);             // left eye
  oled.fillCircle(76, 26, 5, SSD1306_WHITE);             // right eye
  oled.drawLine(54, 40, 74, 40, SSD1306_WHITE);          // smile
  oled.drawLine(64, 2, 64, 8, SSD1306_WHITE);            // antenna
  oled.fillCircle(64, 2, 2, SSD1306_WHITE);
  oled.setTextSize(1);
  oled.setTextColor(SSD1306_WHITE);
  oled.setCursor(40, 54);
  oled.println(F("ROBOTKU"));
  oled.display();
}

// Startup chirp — happens in setup(), so delay() here is fine (not the cmd path).
// Buzzer via ESP32PWM (own timer, coordinated with servos). ms<=0 = play until the
// next call; else loop() silences it at the deadline. Replaces Arduino tone(), whose
// LEDC channel clashed with a servo timer (servo hummed the melody).
void buzzerTone(int freq, long ms) {
  buzzerPwm.writeTone(freq);
  buzzerOffMs = (ms > 0) ? (millis() + ms) : 0;
}
void buzzerOff() {
  buzzerPwm.write(0);   // duty 0 = silent
  buzzerOffMs = 0;
}

void startupTone() {
  buzzerTone(880, 0);  delay(140);
  buzzerTone(1175, 0); delay(140);
  buzzerTone(1568, 0); delay(180);
  buzzerOff();
}

// =============================================================== TELEMETRY
// FIX 5: chunk notifications by the NEGOTIATED MTU (minus the 3-byte ATT header),
// not a fixed 180. The web reassembles across notifications by buffering until a
// ';', so a mid-line split is safe; we just must not exceed the MTU or the stack
// silently drops the tail and the JSON arrives corrupt.
void sendTelemetry(const String& line) {
  if (bleConnected && txChar) {
    size_t maxChunk = (bleMtu > 3) ? (size_t)(bleMtu - 3) : 20;
    for (size_t i = 0; i < line.length(); i += maxChunk) {
      String chunk = line.substring(i, i + maxChunk);
      txChar->setValue((uint8_t*)chunk.c_str(), chunk.length());
      txChar->notify();
    }
  }
  Serial.print(line);   // mirror to USB serial
}

