sudo-kachponz/robotku/firmware/robotku-esp32/src/main.cpp
void sendJson(JsonDocument& doc) {
  String out;
  serializeJson(doc, out);
  out += ";";           // the web parser splits on ';' — always terminate
  sendTelemetry(out);
}

void sendUnsupported(const char* op) {
  JsonDocument d;
  d["command"] = "UNSUPPORTED";
  d["op"] = op;
  sendJson(d);
}

// ---------------------------------------------------- param helpers (FIX 2)
// Duration may arrive as duration_ms | ms | duration (isNull() == key absent).
long readDurationMs(JsonObjectConst p) {
  if (!p["duration_ms"].isNull()) return p["duration_ms"].as<long>();
  if (!p["ms"].isNull())          return p["ms"].as<long>();
  if (!p["duration"].isNull())    return p["duration"].as<long>();
  return 0;
}

// A tiny note-name -> frequency map so PLAY_TONE accepts {"note":"C4"} too.
int noteToFreq(const char* note) {
  struct N { const char* n; int f; };
  static const N tbl[] = {
    {"C4",262},{"D4",294},{"E4",330},{"F4",349},{"G4",392},{"A4",440},{"B4",494},
    {"C5",523},{"D5",587},{"E5",659},{"F5",698},{"G5",784},{"A5",880}
  };
  for (auto& e : tbl) if (strcasecmp(e.n, note) == 0) return e.f;
  return 440;
}

// =========================================================== COMMAND PARSER
void handleCommand(const String& jsonLine) {
  JsonDocument doc;
  if (deserializeJson(doc, jsonLine)) return;   // ignore malformed fragment

  const char* cmd = doc["command"] | "";
  if (cmd[0] == '\0') return;

  // FIX 2 — nested-or-flat shim. Read EVERY parameter through `p`. Block Coding
  // sends {command, params:{...}}; Joystick/bench send flat {command, port,...}.
  // Supporting both means a later web change never forces re-flashing every board.
  JsonObjectConst p = doc["params"].is<JsonObject>() ? doc["params"].as<JsonObjectConst>()
                                                     : doc.as<JsonObjectConst>();

  // Any inbound, well-formed command counts as "link alive".
  lastRxMs = millis();
  failsafeEngaged = false;

  // --- STOP_ALL — safety first, handled before anything else ---------------
  if (strcmp(cmd, "STOP_ALL") == 0) {
    stopAllActuators();
    lastStatus = "STOP";
    return;
  }

  // --- System / handshake --------------------------------------------------
  if (strcmp(cmd, "HELLO") == 0) {
    // FIX 7 — advertise ONLY what actually compiles here.
    JsonDocument ack;
    ack["command"]  = "HELLO_ACK";
    ack["fw"]       = FW_VERSION;
    ack["board"]    = BOARD_NAME;
    ack["protocol"] = PROTOCOL_ID;
    JsonArray caps = ack["capabilities"].to<JsonArray>();
    caps.add("SET_PORT");
    caps.add("STOP_ALL");
    caps.add("STOP");
    caps.add("MOVE_TIMED");
    // Turning needs two independently driven sides. With HAS_SERVO_R = 0 there
    // is only one, so don't advertise it — see the ports scan below.
    if (HAS_SERVO_R) caps.add("TURN_TIMED");
    if (HAS_SERVO_R) caps.add("STEER_TIMED");
    caps.add("WAIT");
    caps.add("PLAY_TONE");
#if HAS_RGB
    caps.add("SET_LED_COLOR");   // FW-06 RGB LED (GPIO16/17/5)
#endif
    if (oledOk) caps.add("DISPLAY_TEXT");   // OLED text — only if the panel answered
    if (oledOk) caps.add("DISPLAY_BITMAP"); // OLED pixel-art
    // Report the ports that are REALLY wired by scanning the config.h table —
    // never a hardcoded list. A board claiming port 2 it doesn't have makes the
    // right joystick axis die silently, which reads as "the web app is broken".
    JsonArray ports = ack["ports"].to<JsonArray>();
    for (int i = 1; i <= 8; i++) {
      if (PORT_CHANNEL[i] >= 0) ports.add(i);
    }
    ack["driveMode"] = "servo";
    ack["hasBuzzer"] = true;
    ack["hasOled"]   = oledOk;                  // real I2C detection (0x3C), not a claim
    ack["hasRgbLed"] = (bool)HAS_RGB;
    ack["boardId"]   = "esp32-controller-v3";
    // Modules actually detected on the bus so the web can enable their blocks.
    if (oledOk) {
      JsonArray periph = ack["peripherals"].to<JsonArray>();
      periph.add("oled-ssd1306");
    }
    sendJson(ack);
    watchdogArmed = true;         // the link is live from here on
    lastStatus = "Terhubung";
    oledStatus("Terhubung", bleConnected ? "via Bluetooth" : "via USB");
    return;
  }

  if (strcmp(cmd, "HEARTBEAT") == 0) {
    JsonDocument ack;
    ack["command"] = "ACK";
    ack["seq"] = doc["seq"] | 0;
    sendJson(ack);
    return;
  }

// --- Joystick ------------------------------------------------------------
  // SET_PORT is LIVE control: no deadline (the joystick keeps sending; the
  // watchdog is the safety net). Map the port through the config.h table.
  if (strcmp(cmd, "SET_PORT") == 0) {
    int port  = p["port"]  | 0;
    int value = p["value"] | 0;
    if (port < 1 || port > 8 || PORT_CHANNEL[port] < 0) {
      sendUnsupported("SET_PORT");   // unwired port — never silent (FIX 4)
      return;
    }
    driveChannel(PORT_CHANNEL[port], value);
    return;
  }

  // --- Block: Forward / Reverse -------------------------------------------
  if (strcmp(cmd, "MOVE_TIMED") == 0) {
    const char* dir = p["direction"] | "forward";
    int speed = constrain((int)(p["speed"] | 60), 0, 100);
    long ms   = readDurationMs(p);
    int sign  = (strcmp(dir, "backward") == 0) ? -1 : 1;   // must read direction (FIX 2)
    driveTank(sign * speed, sign * speed);
    if (ms > 0) motionEndsAtMs = millis() + ms + MOTION_SAFETY_MARGIN_MS;
    lastStatus = (sign > 0) ? "Maju" : "Mundur";
    return;
  }

  // --- Block: Left / Right -------------------------------------------------
  if (strcmp(cmd, "TURN_TIMED") == 0) {
    if (!HAS_SERVO_R) {
      // One driven side can't turn — it would just drive straight. Say so
      // instead of moving wrongly and silently (FIX 4).
      sendUnsupported("TURN_TIMED");
      return;
    }
    const char* dir = p["direction"] | "left";
    int speed = constrain((int)(p["speed"] | 60), 0, 100);
    long ms   = readDurationMs(p);
    // left = left side back + right side forward; right = the mirror.
    bool left = (strcmp(dir, "left") == 0);
    driveTank(left ? -speed : speed, left ? speed : -speed);
    if (ms > 0) motionEndsAtMs = millis() + ms + MOTION_SAFETY_MARGIN_MS;
    lastStatus = left ? "Kiri" : "Kanan";
    return;
  }

  // --- Block: Stop (wheels) ------------------------------------------------
  if (strcmp(cmd, "STOP") == 0) {
    driveTank(0, 0);          // halt the drive servos; leave buzzer/LED alone
    motionEndsAtMs = 0;
    lastStatus = "Stop";
    return;
  }

  // --- Block: Steer (differential) ----------------------------------------
  if (strcmp(cmd, "STEER_TIMED") == 0) {
    if (!HAS_SERVO_R) { sendUnsupported("STEER_TIMED"); return; }  // needs two sides
    int speed    = constrain((int)(p["speed"] | 60), 0, 100);
    int steering = constrain((int)(p["steering"] | 0), -100, 100);
    long ms      = readDurationMs(p);
    float turn = steering / 100.0f;                                // -1..1
    int lspeed = constrain((int)(speed * (1.0f + turn)), -100, 100);
    int rspeed = constrain((int)(speed * (1.0f - turn)), -100, 100);
    driveTank(lspeed, rspeed);
    if (ms > 0) motionEndsAtMs = millis() + ms + MOTION_SAFETY_MARGIN_MS;
    lastStatus = "Belok";
    return;
  }

