sudo-kachponz/robotku/firmware/robotku-esp32/src/main.cpp
  // --- Block: Wait ---------------------------------------------------------
  // Non-blocking no-op: the browser owns sequencing. We ACK so it's clear the
  // command arrived (and so the link stays "alive" — handled above).
  if (strcmp(cmd, "WAIT") == 0) {
    JsonDocument ack;
    ack["command"] = "ACK";
    ack["op"] = "WAIT";
    sendJson(ack);
    return;
  }

  // --- Block: Play Tone ----------------------------------------------------
  if (strcmp(cmd, "PLAY_TONE") == 0) {
    int freq;
    if (!p["frequency"].isNull())  freq = p["frequency"].as<int>();
    else if (!p["note"].isNull())  freq = noteToFreq(p["note"].as<const char*>());
    else                           freq = 440;
    long ms = readDurationMs(p);
    if (ms <= 0) ms = 300;
    buzzerTone(freq, ms);   // non-blocking; loop() silences at the deadline
    lastStatus = "Nada";
    return;
  }

  // --- Block: RGB LED color (FW-06) ---------------------------------------
  if (strcmp(cmd, "SET_LED_COLOR") == 0) {
#if HAS_RGB
    setLedColor(p["r"] | 0, p["g"] | 0, p["b"] | 0);
#else
    sendUnsupported("SET_LED_COLOR");   // no RGB LED on this board (FIX 4)
#endif
    return;
  }

  // --- Block: OLED text — give the screen a name/words --------------------
  if (strcmp(cmd, "DISPLAY_TEXT") == 0) {
    if (oledOk) {
      oledStatus(p["text"] | "", "");   // headline line; reuses the throttled render
    } else {
      sendUnsupported("DISPLAY_TEXT");   // OLED not detected (FIX 4)
    }
    return;
  }

  // --- OLED pixel-art bitmap (from the web pixel editor) -------------------
  if (strcmp(cmd, "DISPLAY_BITMAP") == 0) {
    if (!oledOk) { sendUnsupported("DISPLAY_BITMAP"); return; }
    int w = p["w"] | 0;
    int h = p["h"] | 0;
    const char* px = p["pixels"] | "";
    if (w > 0 && h > 0 && w <= OLED_WIDTH && h <= OLED_HEIGHT && (int)strlen(px) >= w * h) {
      oledBmpW = w;
      oledBmpH = h;
      oledBmp = px;
      oledBitmapMode = true;
      oledDirty = true;
      oledPushIfDue();
    }
    return;
  }

  // --- Anything else -------------------------------------------------------
  // FIX 4: never silent. The old "ignore unknown command" line is exactly why
  // Joystick failed without a trace.
  sendUnsupported(cmd);
}

// ==================================================== TEXT COMMAND FALLBACK
// The web app only ever speaks JSON. Typing JSON by hand into a Serial Monitor is
// miserable, so a bench operator also gets the ControllerV1 vocabulary:
//
//   cw [ms]   ccw [ms]   stop   help   <angka 0-180>
//
// PURELY ADDITIVE — the JSON path above is untouched. This reuses driveChannel() /
// servoWriteAngle() and the SAME non-blocking motionEndsAtMs deadline that loop()
// already enforces; there is no second timer to keep in sync. Replies use
// ControllerV1's [OK]/[ERROR] prefixes and go to USB Serial only: they are not
// JSON, and the web's telemetry parser silently drops non-JSON frames anyway.

void textReply(const char* msg) {
  Serial.print(msg);
  Serial.print('\n');
}

void textHelp() {
  textReply("[OK] perintah teks (selain JSON):");
  textReply("  cw [ms]   - putar arah + (kosongkan ms = sampai stop)");
  textReply("  ccw [ms]  - putar arah -");
  textReply("  stop      - hentikan semua, batalkan tenggat");
  textReply("  0-180     - tulis sudut servo langsung");
  textReply("  help      - tampilkan daftar ini");
  textReply("[OK] JSON tetap jalan, mis: {\"command\":\"STOP_ALL\"};");
}

bool isAllDigits(const String& t) {
  if (t.length() == 0) return false;
  for (unsigned int i = 0; i < t.length(); i++) {
    if (!isDigit(t[i])) return false;
  }
  return true;
}

void handleTextCommand(const String& raw) {
  String line = raw;
  line.replace('\t', ' ');           // some Serial Monitors send tabs
  line.trim();
  if (line.length() == 0) return;

  int sp = line.indexOf(' ');
  String verb = (sp < 0) ? line : line.substring(0, sp);
  String arg  = (sp < 0) ? String("") : line.substring(sp + 1);
  verb.toLowerCase();
  arg.trim();

  if (verb == "help" || verb == "?") {
    textHelp();
    return;
  }

  if (verb == "stop") {
    stopAllActuators();               // also clears motionEndsAtMs
    lastStatus = "STOP";
    oledStatus("STOP", "perintah teks");
    textReply("[OK] stop");
    return;
  }

  if (verb == "cw" || verb == "ccw") {
    if (arg.length() > 0 && !isAllDigits(arg)) {
      textReply("[ERROR] ms harus angka, mis: cw 2000");
      return;
    }
    long ms = (arg.length() > 0) ? arg.toInt() : 0;
    bool cw = (verb == "cw");
    // "cw" = the same direction a POSITIVE SET_PORT drives the left channel, so
    // bench and web agree. The right channel keeps its SERVO_R_INVERT mirroring.
    int value = cw ? 100 : -100;
    driveChannel(0, value);
    if (HAS_SERVO_R) driveChannel(1, value);
    // Same deadline field the JSON path uses. No MOTION_SAFETY_MARGIN_MS here:
    // on the bench there is no browser acting as timekeeper, so the ms typed IS
    // the duration. ms omitted / 0 -> run until an explicit `stop`.
    motionEndsAtMs = (ms > 0) ? (millis() + (unsigned long)ms) : 0;
    lastStatus = cw ? "CW" : "CCW";

    char detail[24];
    if (ms > 0) snprintf(detail, sizeof(detail), "%ld ms", ms);
    else        snprintf(detail, sizeof(detail), "sampai stop");
    oledStatus(lastStatus, detail);

    char ok[48];
    snprintf(ok, sizeof(ok), "[OK] %s %s", cw ? "cw" : "ccw", detail);
    textReply(ok);
    return;
  }

  // A bare number: write the angle straight through, ControllerV1 style. Useful
  // for finding a continuous servo's true neutral before setting SERVO_*_TRIM.
  if (isAllDigits(line)) {
    int deg = line.toInt();
    if (deg > 180) {
      textReply("[ERROR] sudut harus 0-180");
      return;
    }
    motionEndsAtMs = 0;               // a held angle has no deadline
    servoWriteAngle(0, deg);
    if (HAS_SERVO_R) servoWriteAngle(1, deg);
    lastStatus = "Sudut";

    char detail[24];
    snprintf(detail, sizeof(detail), "%d deg", deg);
    oledStatus("Sudut", detail);

    char ok[40];
    snprintf(ok, sizeof(ok), "[OK] sudut %d", deg);
    textReply(ok);
    return;
  }

