sudo-kachponz/robotku/firmware/robotku-esp32/src/main.cpp
  textReply("[ERROR] perintah tidak dikenal - ketik help");
}

// Feed raw bytes into a per-interface buffer, dispatch on ';' or newline.
// A completed line starting with '{' is JSON (the web app); anything else is a
// human at a Serial Monitor, so it goes to the text fallback.
void feed(String& buffer, char c, bool fromSerial) {
  if (c == ';' || c == '\n') {
    String line = buffer;
    line.trim();
    buffer = "";
    if (line.length() == 0) return;   // e.g. the '\n' after a ';' — ignore
    if (fromSerial) usbSeen = true;
    if (line[0] == '{') handleCommand(line);
    else                handleTextCommand(line);
  } else {
    buffer += c;
    // Overflow guard. Must fit the largest command: DISPLAY_BITMAP carries a full
    // 128x64 = 8192-char pixel string (+ JSON wrapper), so allow ~9000. Anything
    // bigger is genuinely malformed -> drop it.
    if (buffer.length() > 9000) buffer = "";
  }
}

// =================================================================== BLE
class ServerCallbacks : public NimBLEServerCallbacks {
  void onConnect(NimBLEServer* server) override {
    (void)server;
    bleConnected = true;
    lastRxMs = millis();
  }
  void onDisconnect(NimBLEServer* server) override {
    bleConnected = false;
    bleMtu = 23;
    stopAllActuators();          // failsafe on link loss
    watchdogArmed = false;       // disarm until the next HELLO (FIX 6)
    lastStatus = "Terputus";
    oledStatus("Terputus", "menunggu...");
    server->startAdvertising();  // allow reconnection
  }
  // FIX 5: capture the negotiated MTU so telemetry chunks correctly.
  void onMTUChange(uint16_t mtu, ble_gap_conn_desc* desc) override {
    (void)desc;
    bleMtu = mtu;
  }
};

class RxCallbacks : public NimBLECharacteristicCallbacks {
  void onWrite(NimBLECharacteristic* chr) override {
    std::string data = chr->getValue();
    for (char c : data) feed(bleBuffer, c, false);
  }
};

void setupBle() {
  NimBLEDevice::init(BLE_NAME);
  NimBLEDevice::setMTU(247);      // FIX 5: ask for a big MTU; peer negotiates down

  NimBLEServer* server = NimBLEDevice::createServer();
  server->setCallbacks(new ServerCallbacks());

  NimBLEService* service = server->createService(NUS_SERVICE_UUID);

  NimBLECharacteristic* rxChar = service->createCharacteristic(
    NUS_RX_CHAR_UUID,
    NIMBLE_PROPERTY::WRITE | NIMBLE_PROPERTY::WRITE_NR);
  rxChar->setCallbacks(new RxCallbacks());

  txChar = service->createCharacteristic(NUS_TX_CHAR_UUID, NIMBLE_PROPERTY::NOTIFY);

  service->start();

  NimBLEAdvertising* adv = NimBLEDevice::getAdvertising();
  adv->addServiceUUID(NUS_SERVICE_UUID);
  adv->setName(BLE_NAME);
  adv->start();
}

// =================================================================== SETUP
void setup() {
  Serial.begin(115200);

  // One coordinated allocator for servos + buzzer so no two share a timer (2 servos
  // + 1 buzzer = 3 of the 4 LEDC timers — fits; this is what stops the servo "singing").
  ESP32PWM::allocateTimer(0);
  ESP32PWM::allocateTimer(1);
  ESP32PWM::allocateTimer(2);
  ESP32PWM::allocateTimer(3);

  // Servos (ESP32Servo): 50 Hz, calibrated pulse range for SG90.
  servoL.setPeriodHertz(50);
  servoL.attach(PIN_SERVO_L, SERVO_MIN_US, SERVO_MAX_US);
  if (HAS_SERVO_R) {             // don't claim a timer for a servo that isn't there
    servoR.setPeriodHertz(50);
    servoR.attach(PIN_SERVO_R, SERVO_MIN_US, SERVO_MAX_US);
  }
  stopAllActuators();

  buzzerPwm.attachPin(PIN_BUZZER, 2000, 10);   // own LEDC timer via the allocator
  buzzerOff();

#if HAS_RGB
  pinMode(PIN_LED_R, OUTPUT);
  pinMode(PIN_LED_G, OUTPUT);
  pinMode(PIN_LED_B, OUTPUT);
  setLedColor(0, 0, 0);   // start dark
#endif

  // OLED
  Wire.begin(PIN_OLED_SDA, PIN_OLED_SCL);
  oledOk = oled.begin(SSD1306_SWITCHCAPVCC, OLED_ADDR);
  if (oledOk) oledSplash();

  startupTone();                  // "robot hidup" cue (delay() ok in setup)

  setupBle();

  oledStatus("Siap", "USB / Bluetooth");
}

// ==================================================================== LOOP
void loop() {
  // 1) Drain USB serial.
  while (Serial.available() > 0) feed(serialBuffer, (char)Serial.read(), true);

  // 2) Non-blocking motion deadline (FIX 3): stop when a timed move expires.
  if (motionEndsAtMs != 0 && (long)(millis() - motionEndsAtMs) >= 0) {
    stopAllActuators();           // also clears motionEndsAtMs
    lastStatus = "Selesai";
    oledStatus("Selesai", "menunggu perintah");
  }

  // 2b) Non-blocking buzzer deadline: silence the tone when its duration expires.
  if (buzzerOffMs != 0 && (long)(millis() - buzzerOffMs) >= 0) buzzerOff();

  // 3) Heartbeat watchdog (FIX 6): only after HELLO; trip once when link quiet.
  if (watchdogArmed && !failsafeEngaged &&
      (millis() - lastRxMs > HEARTBEAT_TIMEOUT_MS)) {
    stopAllActuators();
    failsafeEngaged = true;
    oledStatus("LINK PUTUS", "motor dimatikan");
    JsonDocument fs;
    fs["command"] = "FAILSAFE";
    fs["reason"] = "heartbeat_timeout";
    sendJson(fs);
  }

  // 4) Push a pending OLED frame, at most every OLED_MIN_PUSH_INTERVAL_MS (FIX:
  //    an SSD1306 refresh is ~30 ms of I2C; rendering per command would throttle
  //    the command stream itself).
  oledPushIfDue();
}
